Youssifm/STM32_And_Neopixel_WS2812_LED_Matrix/User/main.c
//Youssif Mahjoubjangk
//sdafasdfsadf/sadf
//sdfasdfasd

//System includes
#include <stm32f10x.h>
#include <stdio.h>													// For sprintf()
#include <stdlib.h>													// For rand()
#include <math.h>														// For floor()
#include <string.h>													// For memset()
#include <stdbool.h>												// For Boolean data type

//User includes
#include "vars.h"														// Global Variables
#include "config.h"													// Functions used to configure peripherals 

// Function Prototypes
void HC06BT_Config(void);
u16 readADC1(u8 channel);
void send_data(uint8_t (*led_Colors), uint16_t len);
void test_LED(float r, float g, float b);
void random_Noise(float r, float g, float b);
void converge_Center(float r, float g, float b);
void rainbow_Loop(void);
void test_Matrix(void);

void Delay(__IO uint32_t nCount) { while(nCount--) { } }

int main() {
	
	//config_BT = true;
	config_BT = false;
	
	if(config_BT) {
		usart_Baud_Rate = 115200;
		Peripheral_Config();
		HC06BT_Config();
	} else {
		
		uint16_t animation_Select;
		uint16_t i, j = 0, adc_Value;
		
		// Configure peripherals
		usart_Baud_Rate = 115200;
		Peripheral_Config();

		// Reset LEDs
		send_data(led_Colors, LED_COUNT);

		animation_Select = 3;

		while (1){  
			
			//while (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == RESET) {}
			//temp = USART_ReceiveData(USART1);
			
				
			switch(animation_Select) {
				case(0) : { test_LED(0, 1, 0); break;}
				case(1) : { random_Noise(1, 1, 1); break;}
				case(2) : { converge_Center(0.1, 0, 0); break; }
				case(3) : { rainbow_Loop(); break; }
				case(4) : { test_Matrix(); break; }
			}
			/*
			memset(&usartBTBuffer, '\0', sizeof(usartBTBuffer));
			sprintf(usartBTBuffer, "Test %d\r\n", j++);
				
			for(i = 0; i < sizeof(usartBTBuffer); i++) {
				if(usartBTBuffer[i] != '\0') {
					while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET) {}
					USART_SendData(USART1, usartBTBuffer[i]);
				} else {
					break; // Exit loop if NULL found
				}
			}*/
			for(i = 0; i < 1*10; i++) { Delay(50000L); }
		} //While(1) l[oop
